Narin-Laboratory/libudawa-esp32/src/libudawa.h
/**
 * UDAWA - Universal Digital Agriculture Watering Assistant
 * Function helper library for ESP32 based UDAWA multi-device firmware development
 * Licensed under aGPLv3
 * Researched and developed by PRITA Research Group & Narin Laboratory
 * prita.undiknas.ac.id | narin.co.id
**/

#ifndef libudawa_h
#define libudawa_h
#include <secret.h>
#include <esp32-hal-log.h>
#include <esp_int_wdt.h>
#include <esp_task_wdt.h>
#include <FS.h>
#include <SPIFFS.h>
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiMulti.h>
#include <WiFiClientSecure.h>
#include <ArduinoJson.h>
#include <StreamUtils.h>
#ifdef USE_WIFI_OTA
#include <ArduinoOTA.h>
#endif
#include "logging.h"
#include "serialLogger.h"
#include <ESP32Time.h>
#include <ESPmDNS.h>
#include <WiFiUdp.h>
#include <ThingsBoard.h>
#include <Update.h>
#include <HTTPClient.h>
#ifdef USE_WEB_IFACE
#include <Crypto.h>
#include <SHA256.h>
#include "mbedtls/md.h"
#include <map>
#ifdef USE_ASYNC_WEB
#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>
#endif
#ifndef USE_ASYNC_WEB
#include <WebServer.h>
#include <WebSocketsServer.h>
#endif
#endif
#ifdef USE_SDCARD_LOG
#include "FS.h"
#include "SD.h"
#include "SPI.h"
#endif

#define countof(a) (sizeof(a) / sizeof(a[0]))
#define COMPILED __DATE__ " " __TIME__
#define S2_RX 16
#define S2_TX 17
#ifndef STACKSIZE_WIFIKEEPER 
  #define STACKSIZE_WIFIKEEPER 4096
#endif
#ifndef STACKSIZE_SETALARM 
#define STACKSIZE_SETALARM 4096
#endif
#ifndef STACKSIZE_WIFIOTA 
#define STACKSIZE_WIFIOTA 4096
#endif
#ifndef STACKSIZE_TB 
#define STACKSIZE_TB 4096
#endif
#ifndef STACKSIZE_IFACE 
#define STACKSIZE_IFACE 4096
#endif
#ifndef DOCSIZE
  #define DOCSIZE 1024
#endif
#ifndef DOCSIZE_MIN
  #define DOCSIZE_MIN 384
#endif
#ifndef DOCSIZE_SETTINGS
  #define DOCSIZE_SETTINGS 2048
#endif

namespace libudawa
{

const char* configFile = "/cfg.json";
const char* configFileCoMCU = "/comcu.json";

struct Config
{
  unsigned long ECP;
  int CC;
  bool SM;

  char hwid[16];
  char name[24];
  char model[16];
  char group[16];
  uint8_t logLev;

  char broker[48];
  uint16_t port;
  char wssid[24];
  char wpass[24];
  char dssid[24];
  char dpass[24];
  char upass[64];
  char accTkn[24];
  bool provSent;

  char provDK[24];
  char provDS[24];

  int gmtOff;

  bool fIoT;
  bool fWOTA;
  bool fIface;
  char hname[40];
  char htU[24];
  char htP[24];
  char webApiKey[32];

  char logIP[16] = "192.168.18.255";
  uint16_t logPrt = 29514;

  #ifdef USE_WEB_IFACE
  uint8_t wsCount = 0;
  unsigned long rateLimitInterval = 1000; // rate limit interval in milliseconds
  unsigned long blockInterval = 1; // block interval in milliseconds

  #endif

  #ifdef USE_SDCARD_LOG
  uint64_t cardSize = 0;
  uint64_t cardByte = 0;
  uint64_t cardUsed = 0;
  #endif
};

struct ConfigCoMCU
{
  bool fP;
  uint16_t bFr;
  bool fB;
  uint8_t pBz;
  uint8_t pLR;
  uint8_t pLG;
  uint8_t pLB;
  uint8_t lON;
};

class ESP32UDPLogger : public ILogHandler
{
    public:
        void log_message(const char *tag, const LogLevel level, const char *fmt, va_list args) override;
};

#ifdef USE_WEB_IFACE
std::map<uint32_t, bool> clientAuthenticationStatus;
std::map<IPAddress, unsigned long> clientAuthAttemptTimestamps; 
#endif

uint32_t micro2milli(uint32_t hi, uint32_t lo);
double round2(double value);
void udawa();
void reboot();
char* getDeviceId();
void cbWiFiOnDisconnected(WiFiEvent_t event, WiFiEventInfo_t info);
void cbWiFiOnGotIp(WiFiEvent_t event, WiFiEventInfo_t info);
void configLoadFailSafe();
void configLoad();
void configSave();
void configReset();
void configCoMCULoadFailSafe();
void configCoMCULoad();
void configCoMCUSave();
void configCoMCUReset();
void (*onSaveSettings)();
bool loadFile(const char* filePath, char* buffer);
void processProvisionResponse(const Provision_Data &data);
void processSharedAttributeRequest(const Shared_Attribute_Data &data);
void processClientAttributeRequest(const Shared_Attribute_Data &data);
void processSharedAttributeUpdate(const Shared_Attribute_Data &data);
void (*processSharedAttributeUpdateCb)(const Shared_Attribute_Data &data);
void startup();
void wifiKeeperTR(void *arg);
void serialWriteToCoMcu(StaticJsonDocument<DOCSIZE_MIN> &doc, bool isRpc);
void serialReadFromCoMcu(StaticJsonDocument<DOCSIZE_MIN> &doc);
void syncConfigCoMCU();
void readSettings(StaticJsonDocument<DOCSIZE> &doc,const char* path);
void writeSettings(StaticJsonDocument<DOCSIZE> &doc, const char* path);
void setCoMCUPin(uint8_t pin, uint8_t op, uint8_t mode, uint16_t aval, uint8_t state);
void rtcUpdate(long ts = 0);
void setBuzzer(int32_t beepCount, uint16_t beepDelay);
void setLed(uint8_t r, uint8_t g, uint8_t b, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay);
void setLed(uint8_t color, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay);
void setAlarm(uint16_t code, uint8_t color, int32_t blinkCount, uint16_t blinkDelay);
void setAlarmTR(void *arg);
void emitAlarm(int code);
void (*emitAlarmCb)(const int code);
#ifdef USE_WEB_IFACE
#ifdef USE_ASYNC_WEB
void hashApiKeyWithSalt(const char *apiKey, const char *salt, char *hashResultHex);
void onWsEventCb(AsyncWebSocket * server, AsyncWebSocketClient * client, AwsEventType type, void * arg, uint8_t *data, size_t len);
#endif
#ifndef USE_ASYNC_WEB
void onWsEventCb(uint8_t num, WStype_t type, uint8_t * payload, size_t length);
void webSendFile(String path, String type);
#endif
void (*wsEventCb)(const JsonObject &payload);
bool wsSendTXT(uint32_t id, const char *buffer);
bool wsBroadcastTXT(const char *buffer);
void ifaceTR(void *arg);
#endif
#ifdef USE_WIFI_OTA
void wifiOtaTR(void *arg);
#endif
void TBTR(void *arg);
void tbOtaFinishedCb(const bool& success);
void tbOtaProgressCb(const uint32_t& currentChunk, const uint32_t& totalChuncks);
void (*httpOtaOnUpdateFinishedCb)(const int partition);
void updateSpiffs();
void (*onTbDisconnectedCb)();
void (*onTbConnectedCb)();
RPC_Response processConfigSave(const RPC_Data &data);
RPC_Response processConfigCoMCUSave(const RPC_Data &data);
RPC_Response processSaveSettings(const RPC_Data &data);
RPC_Response processSetPanic(const RPC_Data &data);
void (*processSetPanicCb)(const RPC_Data &data);
RPC_Response processUpdateSpiffs(const RPC_Data &data);
RPC_Response processReboot(const RPC_Data &data);
RPC_Response processGenericClientRPC(const RPC_Data &data);
RPC_Response (*processGenericClientRPCCb)(const RPC_Data &data);
RPC_Response processUpdateApp(const RPC_Data &data);
void processFwCheckAttributeRequest(const Shared_Attribute_Data &data);
void syncClientAttr(uint8_t direction);
void (*onSyncClientAttrCb)(uint8_t);
bool tbSendAttribute(const char *buffer);
bool tbSendTelemetry(const char *buffer);
void (*tbloggerCb)(const char *error);
void onTbLogger(const char *error);
void (*onMQTTUpdateStartCb)();
void (*onMQTTUpdateEndCb)();
void setupCardLogger();
void writeCardLogger(StaticJsonDocument<DOCSIZE_MIN> &doc);
void wsStreamCardLogger(uint32_t id, String fileName);

class TBLogger {
  public:
    static void log(const char *error) {
      tbloggerCb(error);
    }
};

#ifdef USE_SDCARD_LOG
#define SD_MISO     19
#define SD_MOSI     23
#define SD_SCLK     18
#define SD_CS       5
SPIClass sdSPI(VSPI);
#endif

ESP32SerialLogger serial_logger;
ESP32UDPLogger udp_logger;
LogManager *log_manager = LogManager::GetInstance(LogLevel::VERBOSE);
WiFiClientSecure ssl = WiFiClientSecure();
WiFiMulti wifiMulti;
Config config;
ConfigCoMCU configcomcu;
ThingsBoardSized<32, TBLogger> tb(ssl, DOCSIZE_MIN);
ESP32Time rtc(0);
#ifdef USE_WEB_IFACE
#ifdef USE_ASYNC_WEB
AsyncWebServer web(80);
AsyncWebSocket ws("/ws");
#endif
#ifndef USE_ASYNC_WEB
WebServer web(80);
WebSocketsServer ws = WebSocketsServer(81);
#endif
#endif
bool FLAG_SAVE_SETTINGS = false;
bool FLAG_SAVE_CONFIG = false;
bool FLAG_SAVE_CONFIGCOMCU = false;
bool FLAG_SYNC_CLIENT_ATTR_0 = false;
bool FLAG_SYNC_CLIENT_ATTR_1 = false;
bool FLAG_SYNC_CLIENT_ATTR_2 = false;
bool FLAG_UPDATE_SPIFFS = false;
bool FLAG_ECP_UPDATED = false;
bool FLAG_SM_CLEARED = false;
bool FLAG_WS_STREAM_SDCARD = false;
uint32_t GLOBAL_TARGET_CLIENT_ID = 0;
String GLOBAL_LOG_FILE_NAME = "";

// Client-side RPC that can be executed from cloud
const std::array<RPC_Callback, 8U> clientRPCCallbacks = {
  RPC_Callback{ PSTR("configSave"),    processConfigSave },
  RPC_Callback{ PSTR("configCoMCUSave"), processConfigCoMCUSave },
  RPC_Callback{ PSTR("saveSettings"), processSaveSettings },
  RPC_Callback{ PSTR("updateSpiffs"), processUpdateSpiffs },
  RPC_Callback{ PSTR("setPanic"), processSetPanic }, 
  RPC_Callback{ PSTR("reboot"),  processReboot},
  RPC_Callback{ PSTR("updateApp"), processUpdateApp },
  RPC_Callback{ PSTR("generic"), processGenericClientRPC }
};

