Narin-Laboratory/libudawa-esp32/src/libudawa.h
void emitAlarm(int code){
  if(tb.connected()){
    StaticJsonDocument<32> doc;
    doc[PSTR("alarm")] = code;
    char buffer[32];
    serializeJson(doc, buffer);
    tbSendTelemetry(buffer);
  }
  emitAlarmCb(code);
  log_manager->error(PSTR(__func__), PSTR("%i\n"), code);
}

void rtcUpdate(long ts){
  long startMillis = millis();
  if(ts == 0){
    configTime(config.gmtOff, 0, "pool.ntp.org");
    struct tm timeinfo;
    if (getLocalTime(&timeinfo)){
      rtc.setTimeStruct(timeinfo);
      log_manager->debug(PSTR(__func__), PSTR("Updated time via NTP: %s GMT Offset:%d (%d) \n"), rtc.getDateTime().c_str(), config.gmtOff, config.gmtOff / 3600);
    }
  }else{
      rtc.setTime(ts);
      log_manager->debug(PSTR(__func__), PSTR("Updated time via timestamp: %s\n"), rtc.getDateTime().c_str());
  }
  log_manager->verbose(PSTR(__func__), PSTR("Executed (%dms).\n"), millis() - startMillis);
}

void cbWiFiOnDisconnected(WiFiEvent_t event, WiFiEventInfo_t info)
{
  log_manager->warn(PSTR(__func__),PSTR("WiFi (%s and %s) Disconnected!\n"), config.wssid, config.dssid);
  if(config.fIoT && xHandleTB != NULL){
    vTaskDelete(xHandleTB);
    log_manager->warn(PSTR(__func__), PSTR("Task TB has been deleted.\n"));
  }

  #ifdef USE_WIFI_OTA
  if(config.fWOTA && xHandleWifiOta != NULL){
    vTaskDelete(xHandleWifiOta);
    log_manager->warn(PSTR(__func__), PSTR("Task WifiOta has been deleted.\n"));
  }
  #endif

  #ifdef USE_WEB_IFACE
  if(config.fIface && xHandleIface != NULL){
    vTaskDelete(xHandleIface);
    log_manager->warn(PSTR(__func__), PSTR("Task iface has been deleted.\n"));
  }
  #endif
}

void cbWiFiOnGotIp(WiFiEvent_t event, WiFiEventInfo_t info)
{
  long startMillis = millis();
  IPAddress ip = WiFi.localIP();
  char ipa[25];
  sprintf(ipa, "%d.%d.%d.%d", ip[0], ip[1], ip[2], ip[3]);
  log_manager->warn(PSTR(__func__),PSTR("WiFi (%s) IP Assigned: %s!\n"), WiFi.SSID().c_str(), ipa);

  ssl.setCACert(CA_CERT);

  MDNS.begin(config.hname);
  MDNS.addService("http", "tcp", 80);
  log_manager->info(PSTR(__func__),PSTR("Started MDNS on %s\n"), config.hname);

  rtcUpdate(0);

  #ifdef USE_WIFI_OTA
  if(config.fWOTA && xHandleWifiOta == NULL){
    xReturnedWifiOta = xTaskCreatePinnedToCore(wifiOtaTR, "wifiOta", STACKSIZE_WIFIOTA, NULL, 1, &xHandleWifiOta, 1);
    if(xReturnedWifiOta == pdPASS){
      log_manager->warn(PSTR(__func__), PSTR("Task wifiOta has been created.\n"));
    }
  }
  #endif

  if(config.fIoT && xHandleTB == NULL && !config.SM){
    xReturnedTB = xTaskCreatePinnedToCore(TBTR, "TB", STACKSIZE_TB, NULL, 1, &xHandleTB, 1);
    if(xReturnedTB == pdPASS){
      log_manager->warn(PSTR(__func__), PSTR("Task TB has been created.\n"));
    }
  }

  #ifdef USE_WEB_IFACE
  if(config.fIface && xHandleIface == NULL && !config.SM){
    xReturnedIface = xTaskCreatePinnedToCore(ifaceTR, "iface", STACKSIZE_IFACE, NULL, 1, &xHandleIface, 1);
    if(xReturnedIface == pdPASS){
      log_manager->warn(PSTR(__func__), PSTR("Task iface has been created.\n"));
    }
  }
  #endif

  if(rtc.getYear() < 2023){
    setAlarm(131, 1, 5, 1000);
  }

  setAlarm(0, 0, 3, 50);
  log_manager->verbose(PSTR(__func__), PSTR("Executed (%dms).\n"), millis() - startMillis);
}


void wifiKeeperTR(void *arg){
  log_manager->debug(PSTR(__func__),PSTR("Initializing wifi network...\n"));
  WiFi.mode(WIFI_STA);
  WiFi.setHostname(config.hname);
  WiFi.setAutoReconnect(true);
  if(!config.wssid || *config.wssid == 0x00 || strlen(config.wssid) > 32)
  {
    configLoadFailSafe();
    log_manager->warn(PSTR(__func__), PSTR("SSID too long or missing! Failsafe config was loaded.\n"));
  }
  wifiMulti.addAP(config.wssid, config.wpass);
  wifiMulti.addAP(config.dssid, config.dpass);

  WiFi.onEvent(cbWiFiOnDisconnected, ARDUINO_EVENT_WIFI_STA_DISCONNECTED);
  WiFi.onEvent(cbWiFiOnGotIp, ARDUINO_EVENT_WIFI_STA_GOT_IP);
  
  while (true)
  {
    wifiMulti.run();
    vTaskDelay((const TickType_t) 30000 / portTICK_PERIOD_MS);
  }
}

#ifdef USE_WEB_IFACE
#ifdef USE_ASYNC_WEB
void onWsEventCb(AsyncWebSocket * server, AsyncWebSocketClient * client, AwsEventType type, void * arg, uint8_t *data, size_t len){
  StaticJsonDocument<DOCSIZE_MIN> root;
  JsonObject doc = root.to<JsonObject>();
  IPAddress clientIP = client->remoteIP();
  switch(type) {
    case WS_EVT_DISCONNECT:
      {
        log_manager->verbose(PSTR(__func__), PSTR("Client disconnected [%s]\n"), client->remoteIP().toString().c_str());
        // Remove client from maps
        clientAuthenticationStatus.erase(client->id());
        clientAuthAttemptTimestamps.erase(clientIP);

        if( xSemaphoreConfig != NULL ){
          if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
          {
            if(config.wsCount > 0){
              config.wsCount--;
            }
            xSemaphoreGive( xSemaphoreConfig );
          }
          else
          {
              log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
          }
        }
        log_manager->debug(PSTR(__func__), PSTR("ws [%u] disconnect. WsCount: %d\n"), client->id(), config.wsCount);
        doc["evType"] = (int)WS_EVT_DISCONNECT;
        doc["num"] = client->id();
        wsEventCb(doc);
      }
      break;
    case WS_EVT_CONNECT:
      {
        log_manager->verbose(PSTR(__func__), PSTR("New client arrived [%s]\n"), client->remoteIP().toString().c_str());
        // Initialize client as unauthenticated
        clientAuthenticationStatus[client->id()] = false;
        // Initialize timestamp for rate limiting
      }
      break;
    case WS_EVT_DATA:
      {
        DeserializationError err = deserializeJson(root, data);

        // If client is not authenticated, check credentials
        if(!clientAuthenticationStatus[client->id()]) {
          unsigned long currentTime = millis();
          unsigned long lastAttemptTime = clientAuthAttemptTimestamps[clientIP];

          if (currentTime - lastAttemptTime < config.rateLimitInterval) {
            // Too many attempts in short time, block this IP for blockInterval
            clientAuthAttemptTimestamps[clientIP] = currentTime + config.blockInterval - config.rateLimitInterval;
            log_manager->verbose(PSTR(__func__), PSTR("Too many authentication attempts. Blocking for 60 seconds.\n"));
            client->text(PSTR("{\"status\": {\"code\": 429, \"msg\": \"Too many authentication attempts. Please wait for 60 seconds.\"}}"));
            client->close();
            return;
          }
          
          clientAuthAttemptTimestamps[clientIP] = millis();

          if (err) {
            client->text(PSTR("{\"status\": {\"code\": 400, \"msg\": \"Bad request.\"}}"));
            client->close();
            return;
          }

          if(doc["salt"] == nullptr || doc["auth"] == nullptr){
            client->text(PSTR("{\"status\": {\"code\": 401, \"msg\": \"Unauthorized.\"}}"));
            client->close();
            return;
          }

