Narin-Laboratory/libudawa-esp32/src/libudawa.h
          const char* salt = doc["salt"];
          const char* auth = doc["auth"];

          char hashedApiKey[65];          
          hashApiKeyWithSalt(config.webApiKey, salt, hashedApiKey);
        
          if (strcmp(auth, hashedApiKey) == 0) {
            // Client authenticated successfully, update the status in the map
            clientAuthenticationStatus[client->id()] = true;
            if( xSemaphoreConfig != NULL ){
              if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
              {
                config.wsCount++;
                xSemaphoreGive( xSemaphoreConfig );
              }
              else
              {
                  log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
              }
            }
            client->text(PSTR("{\"status\": {\"code\": 200, \"msg\": \"Authorized.\"}}"));
            log_manager->debug(PSTR(__func__), PSTR("ws [%u] authenticated. WsCount: %d\n"), client->id(), config.wsCount);
            doc["evType"] = (int)WS_EVT_CONNECT;
            doc["num"] = client->id();
            wsEventCb(doc);
          } else {
            // Unauthorized, you can choose to disconnect the client
            client->text(PSTR("{\"status\": {\"code\": 401, \"msg\": \"Unauthorized.\"}}"));
            client->close();
          }

          // Update timestamp for rate limiting
          clientAuthAttemptTimestamps[clientIP] = currentTime;
        }
        else {
          // The client is already authenticated, you can process the received data
          if (err == DeserializationError::Ok)
          {
            log_manager->debug(PSTR(__func__), PSTR("WS message parsing %s\n"), err.c_str());
            doc["evType"] = (int)WS_EVT_DATA;
            doc["num"] = client->id();
            wsEventCb(doc);
          }
          else
          {
            log_manager->warn(PSTR(__func__), PSTR("WS message parsing error: %s\n"), err.c_str());
          }
        }
      }
      break;
    case WS_EVT_ERROR:
      {
        log_manager->warn(PSTR(__func__), PSTR("ws [%u] error\n"), client->id());
        doc["evType"] = (int)WS_EVT_ERROR;
        doc["num"] = client->id();
        wsEventCb(doc);
      }
      break;	
  }
}
#endif
#ifndef USE_ASYNC_WEB
void onWsEventCb(uint8_t num, WStype_t type, uint8_t * data, size_t length){
  StaticJsonDocument<DOCSIZE_MIN> root;
  JsonObject doc = root.to<JsonObject>();
  switch(type) {
    case WStype_DISCONNECTED:
      {
        if( xSemaphoreConfig != NULL ){
          if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
          {
            if(config.wsCount > 0){
              config.wsCount--;
            }
            xSemaphoreGive( xSemaphoreConfig );
          }
          else
          {
              log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
          }
        }
        
        log_manager->debug(PSTR(__func__), PSTR("ws [%u] disconnect. WsCount: %d\n"), num, config.wsCount);
        doc["evType"] = (int)WStype_DISCONNECTED;
        doc["num"] = num;
        wsEventCb(doc);
      }
      break;
    case WStype_CONNECTED:
      {
        if( xSemaphoreConfig != NULL ){
          if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
          {
            config.wsCount++;
            xSemaphoreGive( xSemaphoreConfig );
          }
          else
          {
              log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
          }
        }
        log_manager->debug(PSTR(__func__), PSTR("ws [%u] connect. WsCount: %d\n"), num, config.wsCount);
        doc["evType"] = (int)WStype_CONNECTED;
        doc["num"] = num;
        wsEventCb(doc);
      }
      break;
    case WStype_TEXT:
      {
        DeserializationError err = deserializeJson(root, data);
        if (err == DeserializationError::Ok)
        {
          log_manager->debug(PSTR(__func__), PSTR("WS message parsing %s\n"), err.c_str());
          doc["evType"] = (int)WStype_TEXT;
          doc["num"] = num;
          wsEventCb(doc);
        }
        else
        {
          log_manager->warn(PSTR(__func__), PSTR("WS message parsing error: %s\n"), err.c_str());
        }
      }
      break;
    case WStype_ERROR:
      {
        log_manager->warn(PSTR(__func__), PSTR("ws [%u] error\n"), num);
        doc["evType"] = (int)WStype_ERROR;
        doc["num"] = num;
        wsEventCb(doc);
      }
      break;	
  }
}
#endif
#endif

void setBuzzer(int32_t beepCount, uint16_t beepDelay){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  JsonObject params = doc.createNestedObject("params");
  doc["method"] = "sBuz";
  params["beepCount"] = beepCount;
  params["beepDelay"] = beepDelay;
  serialWriteToCoMcu(doc, 0);
}

void setLed(uint8_t r, uint8_t g, uint8_t b, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  JsonObject params = doc.createNestedObject("params");
  params["r"] = r;
  params["g"] = g;
  params["b"] = b;
  params["isBlink"] = isBlink;
  params["blinkCount"] = blinkCount;
  params["blinkDelay"] = blinkDelay;
  serialWriteToCoMcu(doc, 0);
}

void setLed(uint8_t color, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay){
uint8_t r, g, b;
  switch (color)
  {
  //Auto by network
  case 0:
    if(tb.connected()){
      r = configcomcu.lON == 0 ? 255 : 0;
      g = configcomcu.lON == 0 ? 255 : 0;
      b = configcomcu.lON;
    }
    else if(WiFi.status() == WL_CONNECTED){
      r = configcomcu.lON == 0 ? 255 : 0;
      g = configcomcu.lON;
      b = configcomcu.lON == 0 ? 255 : 0;
    }
    else{
      r = configcomcu.lON;
      g = configcomcu.lON == 0 ? 255 : 0;
      b = configcomcu.lON == 0 ? 255 : 0;
    }
    break;
  //RED
  case 1:
    r = configcomcu.lON;
    g = configcomcu.lON == 0 ? 255 : 0;
    b = configcomcu.lON == 0 ? 255 : 0;
    break;
  //GREEN
  case 2:
    r = configcomcu.lON == 0 ? 255 : 0;
    g = configcomcu.lON;
    b = configcomcu.lON == 0 ? 255 : 0;
    break;
  //BLUE
  case 3:
    r = configcomcu.lON == 0 ? 255 : 0;
    g = configcomcu.lON == 0 ? 255 : 0;
    b = configcomcu.lON;
    break;
  default:
    r = configcomcu.lON;
    g = configcomcu.lON;
    b = configcomcu.lON;
  }
  StaticJsonDocument<DOCSIZE_MIN> doc;
  doc["method"] = "sLed";
  JsonObject params = doc.createNestedObject("params");
  params["r"] = r;
  params["g"] = g;
  params["b"] = b;
  params["isBlink"] = isBlink;
  params["blinkCount"] = blinkCount;
  params["blinkDelay"] = blinkDelay;
  serialWriteToCoMcu(doc, 0);
}

