Narin-Laboratory/libudawa-esp32/src/libudawa.h
const uint32_t MAX_INT = 0xFFFFFFFF;
uint32_t micro2milli(uint32_t hi, uint32_t lo)
{
  if (hi >= 1000)
  {
    log_manager->warn(PSTR(__func__), PSTR("Cannot store milliseconds in uint32!\n"));
  }

  uint32_t r = (lo >> 16) + (hi << 16);
  uint32_t ans = r / 1000;
  r = ((r % 1000) << 16) + (lo & 0xFFFF);
  ans = (ans << 16) + r / 1000;

  return ans;
}

void ESP32UDPLogger::log_message(const char *tag, LogLevel level, const char *fmt, va_list args)
{
    if((int)level > config.logLev || !WiFi.isConnected()){
      return;
    }

    if(xSemaphoreUDPLogger != NULL && xSemaphoreTake(xSemaphoreUDPLogger, (TickType_t) 20))
    {
        int size = 1024;
        WiFiUDP udp;
        char data[size];
        vsnprintf(data, size, fmt, args);
        String msg = String(get_error_char(level)) + "~[" + config.name + "] " + String(tag) + "~" + String(data);
        
        udp.beginPacket(config.logIP, config.logPrt);
        udp.write((uint8_t*)msg.c_str(), msg.length());
        udp.endPacket();

        xSemaphoreGive(xSemaphoreUDPLogger);
    }
    else{
        printf("Could not get UDP semaphore.\n");
    }
}

#ifdef USE_WEB_IFACE
#ifndef USE_ASYNC_WEB
void webSendFile(String path, String type){
  File file = SPIFFS.open(path.c_str(), FILE_READ);
  if(file){
    web.streamFile(file, type.c_str(), 200);
  }else{
    web.send(503, PSTR("text/plain"), PSTR("Server error."));
  }
  file.close();
}
#endif
#endif

void updateSpiffs()
{
    long startMillis = millis();

    HTTPClient _http;
    Serial.printf("Opening item %s\n", spiffsBinUrl );
    log_manager->info(PSTR(__func__), PSTR("Downloading SPIFFS: %s.\n"), spiffsBinUrl);

    _http.begin( spiffsBinUrl );

    const char* get_headers[] = { "Content-Length", "Content-type", "Accept-Ranges" };
    _http.collectHeaders( get_headers, sizeof(get_headers)/sizeof(const char*) );

    int64_t updateSize = 0;
    int httpCode = _http.GET();
    String contentType;

    if( httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY ) {
        updateSize = _http.getSize();
        contentType = _http.header( "Content-type" );
        String acceptRange = _http.header( "Accept-Ranges" );
        if( acceptRange == "bytes" ) {
            log_manager->info(PSTR(__func__), PSTR("This server supports resume!\n"));
        } else {
            log_manager->info(PSTR(__func__), PSTR("This server dose not supports resume!\n"));
        }
    } else {
        log_manager->info(PSTR(__func__), PSTR("Server responded with HTTP Status %s.\n"), httpCode);
        return;
    }

    // TODO: Not all streams respond with a content length.
    // TODO: Set updateSize to UPDATE_SIZE_UNKNOWN when content type is valid.

    // check updateSize and content type
    if( updateSize<=0 ) {
        log_manager->info(PSTR(__func__), PSTR("Response is empty! updateSize: %d, contentType: %s\n"), (int)updateSize, contentType.c_str());
        return;
    }

    log_manager->info(PSTR(__func__), PSTR("updateSize: %d, contentType: %s\n"), (int)updateSize, contentType.c_str());

    Stream* stream = _http.getStreamPtr();
    if( updateSize<=0 || stream == nullptr ) {
        log_manager->warn(PSTR(__func__), PSTR("HTTP Error.\n"));
        return;
    }

    // some network streams (e.g. Ethernet) can be laggy and need to 'breathe'
    if( !stream->available() ) {
        uint32_t timeout = millis() + 3000;
        while( stream->available() ) {
            if( millis()>timeout ) {
                log_manager->warn(PSTR(__func__), PSTR("Stream timed out!\n"));
                return;
            }
            vTaskDelay((const TickType_t)10 / portTICK_PERIOD_MS);
        }
    }

    // If using compression, the size is implicitely unknown
    size_t fwsize = updateSize;       // fw_size is unknown if we have a compressed image

    bool canBegin = Update.begin(updateSize, U_SPIFFS);

    if( !canBegin ) {
        log_manager->warn(PSTR(__func__), PSTR("Not enough space to begin OTA, partition size mismatch?\n"));
        Update.abort();
        return;
    }else{
      setAlarm(0, 3, 1000, 25);
    }

    Update.onProgress( [](size_t progress, size_t size) {
      log_manager->verbose(PSTR(__func__), PSTR("SPIFFS Updater: %d/%d\n"), (int)progress, (int)size);
    });

    Serial.printf("Begin SPIFFS OTA. This may take 2 - 5 mins to complete. Things might be quiet for a while.. Patience!\n");
    // Some activity may appear in the Serial monitor during the update (depends on Update.onProgress)
    size_t written = Update.writeStream(*stream);

    if ( written == fwsize ) {
        log_manager->info(PSTR(__func__), PSTR("Written : %d successfully. \n"), (int)written);
        updateSize = written; // flatten value to prevent overflow when checking signature
    } else {
        log_manager->warn(PSTR(__func__), PSTR("Written only : %d / %d. Premature end of stream?\n"), (int)written, (int)updateSize);
        Update.abort();
        FLAG_SAVE_CONFIG = true;
        FLAG_SAVE_SETTINGS = true;
        FLAG_SAVE_CONFIGCOMCU = true;
        return;
    }

    if (!Update.end()) {
        log_manager->warn(PSTR(__func__), PSTR("An Update Error Occurred: %d\n"), Update.getError());
        setAlarm(0, 0, 0, 1000);
        FLAG_SAVE_CONFIG = true;
        FLAG_SAVE_SETTINGS = true;
        FLAG_SAVE_CONFIGCOMCU = true;
        return;
    }
    if (Update.isFinished()) {
        log_manager->info(PSTR(__func__), PSTR("Update successfully completed.\n"));
        setAlarm(0, 0, 0, 1000);
        FLAG_SAVE_CONFIG = true;
        FLAG_SAVE_SETTINGS = true;
        FLAG_SAVE_CONFIGCOMCU = true;
    } else {
        FLAG_SAVE_CONFIG = true;
        FLAG_SAVE_SETTINGS = true;
        FLAG_SAVE_CONFIGCOMCU = true;
        log_manager->warn(PSTR(__func__), PSTR("Update not finished! Something went wrong!\n"));
    }

    log_manager->verbose(PSTR(__func__), PSTR("Executed (%dms).\n"), millis() - startMillis);    
}

RPC_Response processConfigSave(const RPC_Data &data){
  if( xSemaphoreTBSend != NULL && WiFi.isConnected() && config.provSent && tb.connected()){
    if( xSemaphoreTake( xSemaphoreTBSend, ( TickType_t ) 1000 ) == pdTRUE )
    {
      FLAG_SAVE_CONFIG = true;
      StaticJsonDocument<JSON_OBJECT_SIZE(1)> doc;
      doc[PSTR("configSave")] = 1;
      xSemaphoreGive( xSemaphoreTBSend );
      return RPC_Response(doc);
    }
    else
    {
      log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
    }
  }
  return RPC_Response(PSTR("configSave"), 1);
}

RPC_Response processConfigCoMCUSave(const RPC_Data &data){
  if( xSemaphoreTBSend != NULL && WiFi.isConnected() && config.provSent && tb.connected()){
    if( xSemaphoreTake( xSemaphoreTBSend, ( TickType_t ) 1000 ) == pdTRUE )
    {
      FLAG_SAVE_CONFIGCOMCU = true;
      StaticJsonDocument<JSON_OBJECT_SIZE(1)> doc;
      doc[PSTR("configCoMCUSave")] = 1;
      xSemaphoreGive( xSemaphoreTBSend );
      return RPC_Response(doc);
    }
    else
    {
      log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
    }
  }
  return RPC_Response(PSTR("configCoMCUSave"), 1);
}

RPC_Response processSaveSettings(const RPC_Data &data){
  if( xSemaphoreTBSend != NULL && WiFi.isConnected() && config.provSent && tb.connected()){
    if( xSemaphoreTake( xSemaphoreTBSend, ( TickType_t ) 1000 ) == pdTRUE )
    {
      FLAG_SAVE_SETTINGS = true;
      StaticJsonDocument<JSON_OBJECT_SIZE(1)> doc;
      doc[PSTR("saveSettings")] = 1;
      xSemaphoreGive( xSemaphoreTBSend );
      return RPC_Response(doc);
    }
    else
    {
      log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
    }
  }
  return RPC_Response(PSTR("saveSettings"), 1);
}

RPC_Response processSetPanic(const RPC_Data &data){
  if( xSemaphoreTBSend != NULL && WiFi.isConnected() && config.provSent && tb.connected()){
    if( xSemaphoreTake( xSemaphoreTBSend, ( TickType_t ) 1000 ) == pdTRUE )
    {
      processSetPanicCb(data);
      xSemaphoreGive( xSemaphoreTBSend );
      return RPC_Response(PSTR("setPanic"), configcomcu.fP);
    }
    else
    {
      log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
    }
  }
  return RPC_Response(PSTR("setPanic"), 1);
}

RPC_Response processUpdateSpiffs(const RPC_Data &data){
  if( xSemaphoreTBSend != NULL && WiFi.isConnected() && config.provSent && tb.connected()){
    if( xSemaphoreTake( xSemaphoreTBSend, ( TickType_t ) 1000 ) == pdTRUE )
    {
      FLAG_UPDATE_SPIFFS = true;
      StaticJsonDocument<JSON_OBJECT_SIZE(1)> doc;
      doc[PSTR("updateSpiffs")] = 1;
      xSemaphoreGive( xSemaphoreTBSend );
      return RPC_Response(doc);
    }
    else
    {
      log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
    }
  }
  return RPC_Response(PSTR("updateSpiffs"), 1);
}


RPC_Response processReboot(const RPC_Data &data){
  if( xSemaphoreTBSend != NULL && WiFi.isConnected() && config.provSent && tb.connected()){
    if( xSemaphoreTake( xSemaphoreTBSend, ( TickType_t ) 1000 ) == pdTRUE )
    {
      reboot();
      StaticJsonDocument<JSON_OBJECT_SIZE(1)> doc;
      doc[PSTR("cdown")] = 20; 
      xSemaphoreGive( xSemaphoreTBSend );
      return RPC_Response(doc);
    }
    else
    {
      log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
    }
  }
  return RPC_Response(PSTR("cdown"), 1);
}

RPC_Response processGenericClientRPC(const RPC_Data &data){
  return processGenericClientRPCCb(data);
}

void syncClientAttr(uint8_t direction){
  String ip = WiFi.localIP().toString();
  
