Narin-Laboratory/libudawa-esp32/src/libudawa.h
#ifdef USE_WEB_IFACE
bool wsBroadcastTXT(const char *buffer){
  bool res = false;
  if(config.fIface && config.wsCount > 0){
    if( xSemaphoreWSSend != NULL){
      if( xSemaphoreTake( xSemaphoreWSSend, ( TickType_t ) 1000 ) == pdTRUE )
      {
        #ifdef USE_ASYNC_WEB
        ws.cleanupClients(); // remove disconnected clients
        for(auto& it : clientAuthenticationStatus) {
            if(it.second) { // if the client is authenticated
                AsyncWebSocketClient* client = ws.client(it.first); // get the client using the client id
                if(client != nullptr) {
                    client->text(buffer);
                }
            }
        }
        res = true;
        #endif
        #ifndef USE_ASYNC_WEB
        res = ws.broadcastTXT(buffer);
        #endif
        xSemaphoreGive( xSemaphoreWSSend );
      }
      else
      {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
      }
    }
  }
  return res;
}

bool wsSendTXT(uint32_t id, const char *buffer){
  bool res = false;
  if(config.fIface && config.wsCount > 0){
    if( xSemaphoreWSSend != NULL){
      if( xSemaphoreTake( xSemaphoreWSSend, ( TickType_t ) 1000 ) == pdTRUE )
      {
        #ifdef USE_ASYNC_WEB
        ws.text(id, buffer);
        res = true;
        #endif
        #ifndef USE_ASYNC_WEB
        res = ws.sendTXT(id, buffer);
        #endif
        xSemaphoreGive( xSemaphoreWSSend );
      }
      else
      {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
      }
    }
  }
  return res;
}
#endif

void setupCardLogger()
{
  #ifdef USE_SDCARD_LOG
  sdSPI.begin(SD_SCLK, SD_MISO, SD_MOSI, SD_CS);
  if(!SD.begin(SD_CS, sdSPI)){
    log_manager->warn(PSTR(__func__), PSTR("Card Mount Failed.\n"));
    setAlarm(130, 1, 10, 500);
    return;
  }
  uint8_t cardType = SD.cardType();

  if(cardType == CARD_NONE){
    log_manager->warn(PSTR(__func__), PSTR("No SD card attached.\n"));
    setAlarm(131, 1, 10, 500);
    return;
  }

  if( xSemaphoreSettings != NULL && xSemaphoreTake( xSemaphoreSettings, ( TickType_t ) 1000 ) == pdTRUE )
  {
    config.cardSize = SD.cardSize() / (1024 * 1024);
    config.cardByte = SD.totalBytes();
    config.cardUsed = SD.usedBytes();
    xSemaphoreGive(xSemaphoreSettings);
  }
  if(cardType == CARD_MMC){
    log_manager->debug(PSTR(__func__), PSTR("SD Card Type: NNC, size: %lluMB - byte: %llu - used: %llu\n"), 
      config.cardSize, config.cardByte, config.cardUsed);
  } else if(cardType == CARD_SD){
    log_manager->debug(PSTR(__func__), PSTR("SD Card Type: SDSC, size: %lluMB - byte: %llu - used: %llu\n"), 
      config.cardSize, config.cardByte, config.cardUsed);
  } else if(cardType == CARD_SDHC){
    log_manager->debug(PSTR(__func__), PSTR("SD Card Type: SDHC, size: %lluMB - byte: %llu - used: %llu\n"), 
      config.cardSize, config.cardByte, config.cardUsed);
  } else {
    log_manager->debug(PSTR(__func__), PSTR("SD Card Type: UNKNOWN, size: %lluMB - byte: %llu - used: %llu\n"), 
      config.cardSize, config.cardByte, config.cardUsed);
  }
  #endif
}

void writeCardLogger(StaticJsonDocument<DOCSIZE_MIN> &doc)
{
  if( xSemaphoreCardLogger != NULL && xSemaphoreTake( xSemaphoreCardLogger, ( TickType_t ) 10000 ) == pdTRUE )
  {
    unsigned long ts; String fileName;
    if(rtc.getYear() < 2023)
    {
      fileName = "/www/log/recover.json";
      ts = millis();
    }
    else
    {
      fileName = "/www/log/" + String(rtc.getYear()) + "-" + String(rtc.getMonth()+1) + "-" + String(rtc.getDay()) + ".json";
      ts = rtc.getEpoch();
    }
    #ifdef USE_SDCARD_LOG
    File file = SD.open(fileName.c_str(), FILE_APPEND);
    #endif
    #ifdef USE_SPIFFS_LOG
    File file = SPIFFS.open(fileName.c_str(), FILE_APPEND);
    #endif
    if (!file) {
      log_manager->warn(PSTR(__func__), PSTR("Failed to create the log file %s!\n"), fileName.c_str());
      setAlarm(132, 1, 10, 500);
      xSemaphoreGive( xSemaphoreCardLogger );
      return;
    }
    doc[PSTR("ts")] = ts;
    if (serializeJson(doc, file) == 0) {
      setAlarm(133, 1, 10, 500);
      log_manager->warn(PSTR(__func__), PSTR("Failed to write to the log file %s!\n"), fileName.c_str());
    }
    else
    {
      file.println();
    }

    file.close();
    xSemaphoreGive( xSemaphoreCardLogger );
  }
  else
  {
    log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
  }
}

#ifdef USE_WEB_IFACE
void wsStreamCardLogger(uint32_t id, String fileName)
{
  log_manager->debug(PSTR(__func__), PSTR("Sending log file of %s to %d!\n"), fileName.c_str(), id);
  if( xSemaphoreCardLogger != NULL && xSemaphoreTake( xSemaphoreCardLogger, ( TickType_t ) 0 ) == pdTRUE )
  {
    #ifdef USE_SDCARD_LOG
    File file = SD.open(fileName.c_str(), FILE_READ);
    #endif
    #ifdef USE_SPIFFS_LOG
    File file = SPIFFS.open(fileName.c_str(), FILE_READ);
    #endif
    if (!file) {
      log_manager->warn(PSTR(__func__), PSTR("Failed to open the log file %s!\n"), fileName.c_str());
      xSemaphoreGive( xSemaphoreCardLogger );
      return;
    }

    while (true) {
      StaticJsonDocument<DOCSIZE_MIN> doc;
      char buffer[DOCSIZE_MIN];
      DeserializationError err = deserializeJson(doc, file);
      if (err) 
      {
        doc[PSTR("src")] = PSTR("card-end");
        serializeJson(doc, buffer);
        //wsSendTXT(id, buffer);
        wsBroadcastTXT(buffer);
        break;
      };
      doc[PSTR("src")] = PSTR("card");
      serializeJson(doc, buffer);
      //wsSendTXT(id, buffer);
      wsBroadcastTXT(buffer);
      vTaskDelay((const TickType_t) 50 / portTICK_PERIOD_MS);
    }

    file.close();

    xSemaphoreGive( xSemaphoreCardLogger );
  }
  else
  {
    log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n"));
  }
}

#ifdef USE_ASYNC_WEB
void hashApiKeyWithSalt(const char* apiKey, const char* salt, char outputBuffer[65]) {
  // Convert input strings to UTF-8
  String apiKeyUtf8 = String(apiKey);
  String saltUtf8 = String(salt);

  // Calculate the HMAC
  byte hmac[32];
  const byte* key = (const byte*)apiKeyUtf8.c_str();
  size_t keyLength = apiKeyUtf8.length();
  const byte* message = (const byte*)saltUtf8.c_str();
  size_t messageLength = saltUtf8.length();
  mbedtls_md_context_t ctx;
  mbedtls_md_type_t md_type = MBEDTLS_MD_SHA256;

  mbedtls_md_init(&ctx);
  mbedtls_md_setup(&ctx, mbedtls_md_info_from_type(md_type), 1);
  mbedtls_md_hmac_starts(&ctx, key, keyLength);
  mbedtls_md_hmac_update(&ctx, message, messageLength);
  mbedtls_md_hmac_finish(&ctx, hmac);
  mbedtls_md_free(&ctx);

  // Convert the hash to a hex string
  for (int i = 0; i < 32; i++) {
    sprintf(&outputBuffer[i*2], "%02x", (unsigned int)hmac[i]);
  }
}
#endif
#endif

} // namespace libudawa
#endif